{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "14c5eb74",
   "metadata": {},
   "source": [
    "## Setup and Import Libraries"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "2a10232c",
   "metadata": {},
   "outputs": [],
   "source": [
    "import os\n",
    "from langchain_community.graphs import Neo4jGraph\n",
    "from dotenv import load_dotenv\n",
    "\n",
    "import warnings\n",
    "warnings.filterwarnings(\"ignore\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "c9e0f1b5",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "True"
      ]
     },
     "execution_count": 2,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "load_dotenv()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "4e9e41e0-19bf-4d27-86fc-1fc757dca76e",
   "metadata": {},
   "outputs": [],
   "source": [
    "NEO4J_URI = os.getenv('NEO4J_URI')\n",
    "NEO4J_USERNAME = os.getenv('NEO4J_USERNAME')\n",
    "NEO4J_PASSWORD = os.getenv('NEO4J_PASSWORD')\n",
    "NEO4J_DATABASE = os.getenv('NEO4J_DATABASE')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "e9154386-bf4a-4aaa-9ee5-50316a2610b4",
   "metadata": {},
   "outputs": [],
   "source": [
    "knowledge_graph = Neo4jGraph(\n",
    "    url=NEO4J_URI,\n",
    "    username=NEO4J_USERNAME,\n",
    "    password=NEO4J_PASSWORD,\n",
    "    database=NEO4J_DATABASE\n",
    ")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "77e5fdbe-2afb-46c6-bbd8-9b60e996d472",
   "metadata": {},
   "source": [
    "## Creating Movie Knowledge Graph"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "d495db21-4f9a-42d1-9253-f06a4d99108c",
   "metadata": {},
   "outputs": [],
   "source": [
    "movie_query =\"\"\"\n",
    "LOAD CSV WITH HEADERS FROM\n",
    "'https://raw.githubusercontent.com/tomasonjo/blog-datasets/main/movies/movies_small.csv' as row\n",
    "\n",
    "MERGE(m:Movie{id:row.movieId})\n",
    "SET m.released = date(row.released),\n",
    "    m.title = row.title,\n",
    "    m.imdbRating = toFloat(row.imdbRating)\n",
    "FOREACH (director in split(row.director, '|') | \n",
    "    MERGE (p:Person {name:trim(director)})\n",
    "    MERGE (p)-[:DIRECTED]->(m))\n",
    "FOREACH (actor in split(row.actors, '|') | \n",
    "    MERGE (p:Person {name:trim(actor)})\n",
    "    MERGE (p)-[:ACTED_IN]->(m))\n",
    "FOREACH (genre in split(row.genres, '|') | \n",
    "    MERGE (g:Genre {name:trim(genre)})\n",
    "    MERGE (m)-[:IN_GENRE]->(g))\n",
    "\"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "05fcbd4c-37a1-42eb-8320-3b7a3c4bf6ea",
   "metadata": {},
   "outputs": [],
   "source": [
    "result = knowledge_graph.query(movie_query)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "fd7e313c-3f3e-47ba-a0d3-5759cf96a679",
   "metadata": {},
   "source": [
    "## Query Movie Knowledge Graph"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "5da080ef-1d61-4e9a-8dd9-719d31189b38",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'count(n)': 1557}]"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher = \"\"\"\n",
    "    MATCH (n) \n",
    "    RETURN count(n)\n",
    "\"\"\"\n",
    "\n",
    "result = knowledge_graph.query(cypher)\n",
    "result"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "ccdbe57f-7090-4b2c-8677-3d21df8b5859",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'numberOfNodes': 1557}]"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher = \"\"\"\n",
    "    MATCH (n) \n",
    "    RETURN count(n) AS numberOfNodes\n",
    "\"\"\"\n",
    "\n",
    "result = knowledge_graph.query(cypher)\n",
    "result"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "5fea7838-86c1-4659-9b85-dbc8580fa4fa",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "There are 1557 nodes in this graph.\n"
     ]
    }
   ],
   "source": [
    "print(f\"There are {result[0]['numberOfNodes']} nodes in this graph.\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "2a31e7b2-02e3-41fe-b061-6b944f58f96c",
   "metadata": {},
   "source": [
    "### Match Movie Nodes"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "id": "22109453-340f-4bb2-991f-f284204b1250",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'numberOfMovies': 299}]"
      ]
     },
     "execution_count": 13,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher = \"\"\"\n",
    "    MATCH (m:Movie) \n",
    "    RETURN count(m) AS numberOfMovies\n",
    "\"\"\"\n",
    "\n",
    "result = knowledge_graph.query(cypher)\n",
    "result"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "9ecf989a-e9b5-43a3-b618-4b58fa4cc09b",
   "metadata": {},
   "source": [
    "### Match Person Nodes"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "id": "7bc92e8b-3475-4f5e-b63d-0da2289fc398",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'numberOfPeople': 1239}]"
      ]
     },
     "execution_count": 14,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher = \"\"\"\n",
    "    MATCH (p:Person) \n",
    "    RETURN count(p) AS numberOfPeople\n",
    "\"\"\"\n",
    "\n",
    "result = knowledge_graph.query(cypher)\n",
    "result"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "41e0fd18-4ec8-4cbc-85bd-fa393dfc4799",
   "metadata": {},
   "source": [
    "### Match by Person"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "id": "e551bdc5-3e68-41ce-bc6f-b773d463c30d",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'tom': {'name': 'Tom Hanks'}}]"
      ]
     },
     "execution_count": 15,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher = \"\"\"\n",
    "    MATCH (tom:Person {name:\"Tom Hanks\"}) \n",
    "    RETURN tom\n",
    "\"\"\"\n",
    "\n",
    "result = knowledge_graph.query(cypher)\n",
    "result"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "c76c6078-cb19-4283-ae3d-9eafed38b3bb",
   "metadata": {},
   "source": [
    "### Match by Movie"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "id": "311fc1b6-01c1-4626-8ba3-0875371e20ce",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'movie': {'imdbRating': 8.3,\n",
       "   'id': '1',\n",
       "   'title': 'Toy Story',\n",
       "   'released': neo4j.time.Date(1995, 11, 22)}}]"
      ]
     },
     "execution_count": 16,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher = \"\"\"\n",
    "    MATCH (movie:Movie {title:\"Toy Story\"}) \n",
    "    RETURN movie\n",
    "\"\"\"\n",
    "\n",
    "result = knowledge_graph.query(cypher)\n",
    "result"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "id": "84a894c7-f261-4531-aa8c-714a60fdc00c",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'movie.released': neo4j.time.Date(1995, 11, 22)}]"
      ]
     },
     "execution_count": 17,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher = \"\"\"\n",
    "    MATCH (movie:Movie {title:\"Toy Story\"}) \n",
    "    RETURN movie.released\n",
    "\"\"\"\n",
    "\n",
    "result = knowledge_graph.query(cypher)\n",
    "result"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "id": "fd85e8c4-c48a-43f0-a45e-15fbd959386f",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'movie.released': neo4j.time.Date(1995, 11, 22), 'movie.imdbRating': 8.3}]"
      ]
     },
     "execution_count": 18,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher = \"\"\"\n",
    "    MATCH (movie:Movie {title:\"Toy Story\"}) \n",
    "    RETURN movie.released, movie.imdbRating\n",
    "\"\"\"\n",
    "\n",
    "result = knowledge_graph.query(cypher)\n",
    "result"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "9888468a-f2c9-4d09-8c37-b5ba4b3bcadc",
   "metadata": {},
   "source": [
    "### Conditional Matching"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "id": "572b4155-89ef-4081-9670-49b9274bb15f",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'nineties.title': 'Toy Story'},\n",
       " {'nineties.title': 'Jumanji'},\n",
       " {'nineties.title': 'Grumpier Old Men'},\n",
       " {'nineties.title': 'Waiting to Exhale'},\n",
       " {'nineties.title': 'Father of the Bride Part II'},\n",
       " {'nineties.title': 'Heat'},\n",
       " {'nineties.title': 'Sabrina'},\n",
       " {'nineties.title': 'Tom and Huck'},\n",
       " {'nineties.title': 'Sudden Death'},\n",
       " {'nineties.title': 'GoldenEye'},\n",
       " {'nineties.title': 'American President, The'},\n",
       " {'nineties.title': 'Dracula: Dead and Loving It'},\n",
       " {'nineties.title': 'Balto'},\n",
       " {'nineties.title': 'Nixon'},\n",
       " {'nineties.title': 'Cutthroat Island'},\n",
       " {'nineties.title': 'Casino'},\n",
       " {'nineties.title': 'Sense and Sensibility'},\n",
       " {'nineties.title': 'Four Rooms'},\n",
       " {'nineties.title': 'Ace Ventura: When Nature Calls'},\n",
       " {'nineties.title': 'Money Train'},\n",
       " {'nineties.title': 'Get Shorty'},\n",
       " {'nineties.title': 'Copycat'},\n",
       " {'nineties.title': 'Assassins'},\n",
       " {'nineties.title': 'Powder'},\n",
       " {'nineties.title': 'Leaving Las Vegas'},\n",
       " {'nineties.title': 'Othello'},\n",
       " {'nineties.title': 'Now and Then'},\n",
       " {'nineties.title': 'Persuasion'},\n",
       " {'nineties.title': 'City of Lost Children, The (Cité des enfants perdus, La)'},\n",
       " {'nineties.title': 'Shanghai Triad (Yao a yao yao dao waipo qiao)'},\n",
       " {'nineties.title': 'Dangerous Minds'},\n",
       " {'nineties.title': 'Twelve Monkeys (a.k.a. 12 Monkeys)'},\n",
       " {'nineties.title': 'Babe'},\n",
       " {'nineties.title': 'Carrington'},\n",
       " {'nineties.title': 'Dead Man Walking'},\n",
       " {'nineties.title': 'Across the Sea of Time'},\n",
       " {'nineties.title': 'It Takes Two'},\n",
       " {'nineties.title': 'Clueless'},\n",
       " {'nineties.title': 'Cry, the Beloved Country'},\n",
       " {'nineties.title': 'Richard III'},\n",
       " {'nineties.title': 'Dead Presidents'},\n",
       " {'nineties.title': 'Restoration'},\n",
       " {'nineties.title': 'Mortal Kombat'},\n",
       " {'nineties.title': 'To Die For'},\n",
       " {'nineties.title': 'How to Make an American Quilt'},\n",
       " {'nineties.title': 'Seven (a.k.a. Se7en)'},\n",
       " {'nineties.title': 'Pocahontas'},\n",
       " {'nineties.title': 'When Night Is Falling'},\n",
       " {'nineties.title': 'Usual Suspects, The'},\n",
       " {'nineties.title': 'Mighty Aphrodite'},\n",
       " {'nineties.title': 'Lamerica'},\n",
       " {'nineties.title': 'Big Green, The'},\n",
       " {'nineties.title': 'Georgia'},\n",
       " {'nineties.title': 'Home for the Holidays'},\n",
       " {'nineties.title': 'Postman, The (Postino, Il)'},\n",
       " {'nineties.title': 'Confessional, The (Confessionnal, Le)'},\n",
       " {'nineties.title': 'Indian in the Cupboard, The'},\n",
       " {'nineties.title': 'Eye for an Eye'},\n",
       " {'nineties.title': \"Mr. Holland's Opus\"},\n",
       " {'nineties.title': \"Don't Be a Menace to South Central While Drinking Your Juice in the Hood\"},\n",
       " {'nineties.title': 'Two if by Sea'},\n",
       " {'nineties.title': 'Bio-Dome'},\n",
       " {'nineties.title': 'Lawnmower Man 2: Beyond Cyberspace'},\n",
       " {'nineties.title': 'French Twist (Gazon maudit)'},\n",
       " {'nineties.title': 'Friday'},\n",
       " {'nineties.title': 'From Dusk Till Dawn'},\n",
       " {'nineties.title': 'Fair Game'},\n",
       " {'nineties.title': 'Kicking and Screaming'},\n",
       " {'nineties.title': 'Misérables, Les'},\n",
       " {'nineties.title': 'Bed of Roses'},\n",
       " {'nineties.title': 'Screamers'},\n",
       " {'nineties.title': 'Nico Icon'},\n",
       " {'nineties.title': 'Crossing Guard, The'},\n",
       " {'nineties.title': 'Juror, The'},\n",
       " {'nineties.title': 'White Balloon, The (Badkonake sefid)'},\n",
       " {'nineties.title': \"Things to Do in Denver When You're Dead\"},\n",
       " {'nineties.title': \"Antonia's Line (Antonia)\"},\n",
       " {'nineties.title': 'Once Upon a Time... When We Were Colored'},\n",
       " {'nineties.title': 'Last Summer in the Hamptons'},\n",
       " {'nineties.title': 'Angels and Insects'},\n",
       " {'nineties.title': 'White Squall'},\n",
       " {'nineties.title': 'Dunston Checks In'},\n",
       " {'nineties.title': 'Black Sheep'},\n",
       " {'nineties.title': 'Nick of Time'},\n",
       " {'nineties.title': 'Mary Reilly'},\n",
       " {'nineties.title': 'Vampire in Brooklyn'},\n",
       " {'nineties.title': 'Beautiful Girls'},\n",
       " {'nineties.title': 'Broken Arrow'},\n",
       " {'nineties.title': 'In the Bleak Midwinter'},\n",
       " {'nineties.title': 'Hate (Haine, La)'},\n",
       " {'nineties.title': 'Shopping'},\n",
       " {'nineties.title': 'Heidi Fleiss: Hollywood Madam'},\n",
       " {'nineties.title': 'City Hall'},\n",
       " {'nineties.title': 'Bottle Rocket'},\n",
       " {'nineties.title': 'Mr. Wrong'},\n",
       " {'nineties.title': 'Unforgettable'},\n",
       " {'nineties.title': 'Happy Gilmore'},\n",
       " {'nineties.title': 'Bridges of Madison County, The'},\n",
       " {'nineties.title': 'Muppet Treasure Island'},\n",
       " {'nineties.title': 'Catwalk'},\n",
       " {'nineties.title': 'Braveheart'},\n",
       " {'nineties.title': 'Rumble in the Bronx (Hont faan kui)'},\n",
       " {'nineties.title': 'Before and After'},\n",
       " {'nineties.title': \"Margaret's Museum\"},\n",
       " {'nineties.title': 'Anne Frank Remembered'},\n",
       " {'nineties.title': \"Young Poisoner's Handbook, The\"},\n",
       " {'nineties.title': 'If Lucy Fell'},\n",
       " {'nineties.title': 'Steal Big, Steal Little'},\n",
       " {'nineties.title': 'Boys of St. Vincent, The'},\n",
       " {'nineties.title': 'Boomerang'},\n",
       " {'nineties.title': 'Chungking Express (Chung Hing sam lam)'},\n",
       " {'nineties.title': \"Star Maker, The (Uomo delle stelle, L')\"},\n",
       " {'nineties.title': 'Flirting With Disaster'},\n",
       " {'nineties.title': 'NeverEnding Story III, The'},\n",
       " {'nineties.title': 'Pie in the Sky'},\n",
       " {'nineties.title': 'Angela'},\n",
       " {'nineties.title': 'Frankie Starlight'},\n",
       " {'nineties.title': 'Jade'},\n",
       " {'nineties.title': 'Down Periscope'},\n",
       " {'nineties.title': 'Man of the Year'},\n",
       " {'nineties.title': 'Up Close and Personal'},\n",
       " {'nineties.title': 'Birdcage, The'},\n",
       " {'nineties.title': 'Brothers McMullen, The'},\n",
       " {'nineties.title': 'Bad Boys'},\n",
       " {'nineties.title': 'Amazing Panda Adventure, The'},\n",
       " {'nineties.title': 'Basketball Diaries, The'},\n",
       " {'nineties.title': 'Awfully Big Adventure, An'},\n",
       " {'nineties.title': 'Amateur'},\n",
       " {'nineties.title': 'Apollo 13'},\n",
       " {'nineties.title': 'Rob Roy'},\n",
       " {'nineties.title': 'Addiction, The'},\n",
       " {'nineties.title': 'Batman Forever'},\n",
       " {'nineties.title': 'Beyond Rangoon'},\n",
       " {'nineties.title': 'Blue in the Face'},\n",
       " {'nineties.title': 'Canadian Bacon'},\n",
       " {'nineties.title': 'Casper'},\n",
       " {'nineties.title': 'Clockers'},\n",
       " {'nineties.title': 'Congo'},\n",
       " {'nineties.title': 'Crimson Tide'},\n",
       " {'nineties.title': 'Crumb'},\n",
       " {'nineties.title': 'Desperado'},\n",
       " {'nineties.title': 'Devil in a Blue Dress'},\n",
       " {'nineties.title': 'Die Hard: With a Vengeance'},\n",
       " {'nineties.title': 'Doom Generation, The'},\n",
       " {'nineties.title': 'Feast of July'},\n",
       " {'nineties.title': 'First Knight'},\n",
       " {'nineties.title': 'Free Willy 2: The Adventure Home'},\n",
       " {'nineties.title': 'Hackers'},\n",
       " {'nineties.title': 'Jeffrey'},\n",
       " {'nineties.title': 'Johnny Mnemonic'},\n",
       " {'nineties.title': 'Judge Dredd'},\n",
       " {'nineties.title': 'Jury Duty'},\n",
       " {'nineties.title': 'Kids'},\n",
       " {'nineties.title': 'Living in Oblivion'},\n",
       " {'nineties.title': 'Lord of Illusions'},\n",
       " {'nineties.title': 'Love & Human Remains'},\n",
       " {'nineties.title': 'Mad Love'},\n",
       " {'nineties.title': 'Mallrats'},\n",
       " {'nineties.title': 'Mighty Morphin Power Rangers: The Movie'},\n",
       " {'nineties.title': 'Mute Witness'},\n",
       " {'nineties.title': 'Nadja'},\n",
       " {'nineties.title': 'Net, The'},\n",
       " {'nineties.title': 'Nine Months'},\n",
       " {'nineties.title': 'Party Girl'},\n",
       " {'nineties.title': 'Prophecy, The'},\n",
       " {'nineties.title': 'Reckless'},\n",
       " {'nineties.title': 'Safe'},\n",
       " {'nineties.title': 'Scarlet Letter, The'},\n",
       " {'nineties.title': 'Showgirls'},\n",
       " {'nineties.title': 'Smoke'},\n",
       " {'nineties.title': 'Something to Talk About'},\n",
       " {'nineties.title': 'Species'},\n",
       " {'nineties.title': 'Strange Days'},\n",
       " {'nineties.title': 'Tie That Binds, The'},\n",
       " {'nineties.title': 'Three Wishes'},\n",
       " {'nineties.title': 'Total Eclipse'},\n",
       " {'nineties.title': 'To Wong Foo, Thanks for Everything! Julie Newmar'},\n",
       " {'nineties.title': 'Under Siege 2: Dark Territory'},\n",
       " {'nineties.title': 'Unstrung Heroes'},\n",
       " {'nineties.title': 'Unzipped'},\n",
       " {'nineties.title': 'Walk in the Clouds, A'},\n",
       " {'nineties.title': 'Waterworld'},\n",
       " {'nineties.title': \"White Man's Burden\"},\n",
       " {'nineties.title': 'Browning Version, The'},\n",
       " {'nineties.title': 'Burnt by the Sun (Utomlyonnye solntsem)'},\n",
       " {'nineties.title': 'Before the Rain (Pred dozhdot)'},\n",
       " {'nineties.title': 'Before Sunrise'},\n",
       " {'nineties.title': 'Billy Madison'},\n",
       " {'nineties.title': 'Babysitter, The'},\n",
       " {'nineties.title': 'Boys on the Side'},\n",
       " {'nineties.title': 'Cure, The'},\n",
       " {'nineties.title': 'Castle Freak'},\n",
       " {'nineties.title': 'Circle of Friends'},\n",
       " {'nineties.title': 'Clerks'},\n",
       " {'nineties.title': 'Don Juan DeMarco'},\n",
       " {'nineties.title': 'Disclosure'},\n",
       " {'nineties.title': 'Drop Zone'},\n",
       " {'nineties.title': 'Destiny Turns on the Radio'},\n",
       " {'nineties.title': 'Death and the Maiden'},\n",
       " {'nineties.title': 'Dolores Claiborne'},\n",
       " {'nineties.title': 'Dumb & Dumber (Dumb and Dumber)'},\n",
       " {'nineties.title': 'Eat Drink Man Woman (Yin shi nan nu)'},\n",
       " {'nineties.title': 'Exotica'},\n",
       " {'nineties.title': 'Exit to Eden'},\n",
       " {'nineties.title': 'Ed Wood'},\n",
       " {'nineties.title': 'French Kiss'},\n",
       " {'nineties.title': 'Forget Paris'},\n",
       " {'nineties.title': 'Far From Home: The Adventures of Yellow Dog'},\n",
       " {'nineties.title': 'Goofy Movie, A'},\n",
       " {'nineties.title': 'Hideaway'},\n",
       " {'nineties.title': 'Fluke'},\n",
       " {'nineties.title': 'Farinelli: il castrato'},\n",
       " {'nineties.title': 'Gordy'},\n",
       " {'nineties.title': 'Gumby: The Movie'},\n",
       " {'nineties.title': 'The Glass Shield'},\n",
       " {'nineties.title': 'Hoop Dreams'},\n",
       " {'nineties.title': 'Heavenly Creatures'},\n",
       " {'nineties.title': 'Houseguest'},\n",
       " {'nineties.title': 'Immortal Beloved'},\n",
       " {'nineties.title': 'Heavyweights (Heavy Weights)'},\n",
       " {'nineties.title': 'Hunted, The'},\n",
       " {'nineties.title': 'I.Q.'},\n",
       " {'nineties.title': 'Interview with the Vampire: The Vampire Chronicles'},\n",
       " {'nineties.title': 'Jefferson in Paris'},\n",
       " {'nineties.title': 'Jerky Boys, The'},\n",
       " {'nineties.title': 'Junior'},\n",
       " {'nineties.title': 'Just Cause'},\n",
       " {'nineties.title': \"Kid in King Arthur's Court, A\"},\n",
       " {'nineties.title': 'Kiss of Death'},\n",
       " {'nineties.title': 'Little Women'},\n",
       " {'nineties.title': 'Little Princess, A'},\n",
       " {'nineties.title': 'Ladybird Ladybird'},\n",
       " {'nineties.title': \"Enfer, L'\"},\n",
       " {'nineties.title': 'Like Water for Chocolate (Como agua para chocolate)'},\n",
       " {'nineties.title': 'Legends of the Fall'},\n",
       " {'nineties.title': 'Major Payne'},\n",
       " {'nineties.title': 'Little Odessa'},\n",
       " {'nineties.title': 'My Crazy Life (Mi vida loca)'},\n",
       " {'nineties.title': 'Love Affair'},\n",
       " {'nineties.title': 'Losing Isaiah'},\n",
       " {'nineties.title': 'Madness of King George, The'},\n",
       " {'nineties.title': \"Mary Shelley's Frankenstein (Frankenstein)\"},\n",
       " {'nineties.title': 'Man of the House'},\n",
       " {'nineties.title': 'Mixed Nuts'},\n",
       " {'nineties.title': 'Milk Money'},\n",
       " {'nineties.title': 'Miracle on 34th Street'},\n",
       " {'nineties.title': 'Miami Rhapsody'},\n",
       " {'nineties.title': 'My Family'},\n",
       " {'nineties.title': 'Murder in the First'},\n",
       " {'nineties.title': \"Nobody's Fool\"},\n",
       " {'nineties.title': 'Nell'},\n",
       " {'nineties.title': 'New Jersey Drive'},\n",
       " {'nineties.title': 'Beyond Bedlam'},\n",
       " {'nineties.title': 'Nina Takes a Lover'},\n",
       " {'nineties.title': 'Natural Born Killers'},\n",
       " {'nineties.title': 'Only You'},\n",
       " {'nineties.title': 'Once Were Warriors'},\n",
       " {'nineties.title': 'Poison Ivy II'},\n",
       " {'nineties.title': 'Outbreak'},\n",
       " {'nineties.title': 'Léon: The Professional (a.k.a. The Professional) (Léon)'},\n",
       " {'nineties.title': 'Perez Family, The'},\n",
       " {'nineties.title': \"Pyromaniac's Love Story, A\"},\n",
       " {'nineties.title': 'Pulp Fiction'},\n",
       " {'nineties.title': 'Priest'},\n",
       " {'nineties.title': 'Quiz Show'},\n",
       " {'nineties.title': 'Picture Bride (Bijo photo)'},\n",
       " {'nineties.title': 'Queen Margot (Reine Margot, La)'},\n",
       " {'nineties.title': 'Quick and the Dead, The'},\n",
       " {'nineties.title': 'Roommates'},\n",
       " {'nineties.title': 'Ready to Wear (Pret-A-Porter)'},\n",
       " {'nineties.title': 'Three Colors: Red (Trois couleurs: Rouge)'},\n",
       " {'nineties.title': 'Three Colors: Blue (Trois couleurs: Bleu)'},\n",
       " {'nineties.title': 'Three Colors: White (Trzy kolory: Bialy)'},\n",
       " {'nineties.title': 'Red Firecracker, Green Firecracker (Pao Da Shuang Deng)'},\n",
       " {'nineties.title': 'Stuart Saves His Family'},\n",
       " {'nineties.title': 'Swan Princess, The'},\n",
       " {'nineties.title': 'Secret of Roan Inish, The'},\n",
       " {'nineties.title': 'Specialist, The'},\n",
       " {'nineties.title': 'Stargate'},\n",
       " {'nineties.title': 'Santa Clause, The'},\n",
       " {'nineties.title': 'Shawshank Redemption, The'},\n",
       " {'nineties.title': 'Shallow Grave'},\n",
       " {'nineties.title': 'Suture'},\n",
       " {'nineties.title': 'Strawberry and Chocolate (Fresa y chocolate)'},\n",
       " {'nineties.title': 'Swimming with Sharks'},\n",
       " {'nineties.title': 'Sum of Us, The'},\n",
       " {'nineties.title': \"National Lampoon's Senior Trip\"},\n",
       " {'nineties.title': 'To Live (Huozhe)'},\n",
       " {'nineties.title': 'Tank Girl'},\n",
       " {'nineties.title': 'Tales from the Crypt Presents: Demon Knight'},\n",
       " {'nineties.title': 'Star Trek: Generations'},\n",
       " {'nineties.title': 'Tales from the Hood'},\n",
       " {'nineties.title': 'Tom & Viv'},\n",
       " {'nineties.title': 'Village of the Damned'},\n",
       " {'nineties.title': 'Tommy Boy'}]"
      ]
     },
     "execution_count": 20,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher = \"\"\"\n",
    "    MATCH (nineties:Movie) \n",
    "    WHERE nineties.released >= date(\"1990-01-01\") \n",
    "    AND nineties.released < date(\"2000-01-01\") \n",
    "    RETURN nineties.title\n",
    "\"\"\"\n",
    "\n",
    "result = knowledge_graph.query(cypher)\n",
    "result"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "2c1dfbb6-42a1-4fe3-8b54-1352121ad1ed",
   "metadata": {},
   "source": [
    "### Patterns with Multiple Nodes"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "id": "95ee897d-e3ba-4c3b-bbcf-0b8af952406b",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'person.name': 'Jim Varney', 'movie.title': 'Toy Story'},\n",
       " {'person.name': 'Tim Allen', 'movie.title': 'Toy Story'},\n",
       " {'person.name': 'Tom Hanks', 'movie.title': 'Toy Story'},\n",
       " {'person.name': 'Don Rickles', 'movie.title': 'Toy Story'},\n",
       " {'person.name': 'Robin Williams', 'movie.title': 'Jumanji'},\n",
       " {'person.name': 'Bradley Pierce', 'movie.title': 'Jumanji'},\n",
       " {'person.name': 'Kirsten Dunst', 'movie.title': 'Jumanji'},\n",
       " {'person.name': 'Jonathan Hyde', 'movie.title': 'Jumanji'},\n",
       " {'person.name': 'Walter Matthau', 'movie.title': 'Grumpier Old Men'},\n",
       " {'person.name': 'Ann-Margret', 'movie.title': 'Grumpier Old Men'}]"
      ]
     },
     "execution_count": 21,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher = \"\"\"\n",
    "    MATCH (person:Person)-[:ACTED_IN]->(movie:Movie) \n",
    "    RETURN person.name, movie.title LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "result = knowledge_graph.query(cypher)\n",
    "result"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "id": "1bb79ef3-d186-4319-beb4-c2fc855961d0",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'person.name': 'Tom Hanks', 'movie.title': 'Toy Story'},\n",
       " {'person.name': 'Tom Hanks', 'movie.title': 'Apollo 13'}]"
      ]
     },
     "execution_count": 22,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher = \"\"\"\n",
    "    MATCH (person:Person {name: \"Tom Hanks\"})-[:ACTED_IN]->(movie:Movie) \n",
    "    RETURN person.name,movie. title\n",
    "\"\"\"\n",
    "\n",
    "result = knowledge_graph.query(cypher)\n",
    "result"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "id": "ecf30866-40c7-447b-aebb-bf1c6eeefc83",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'coActors.name': 'Jim Varney', 'movie.title': 'Toy Story'},\n",
       " {'coActors.name': 'Tim Allen', 'movie.title': 'Toy Story'},\n",
       " {'coActors.name': 'Don Rickles', 'movie.title': 'Toy Story'},\n",
       " {'coActors.name': 'Kevin Bacon', 'movie.title': 'Apollo 13'},\n",
       " {'coActors.name': 'Bill Paxton', 'movie.title': 'Apollo 13'},\n",
       " {'coActors.name': 'Gary Sinise', 'movie.title': 'Apollo 13'}]"
      ]
     },
     "execution_count": 23,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher = \"\"\"\n",
    "    MATCH (person:Person {name:\"Tom Hanks\"})-[:ACTED_IN]->(movie)<-[:ACTED_IN]-(coActors) \n",
    "    RETURN coActors.name, movie.title\n",
    "\"\"\"\n",
    "\n",
    "result = knowledge_graph.query(cypher)\n",
    "result"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "4cad35ef-6929-42c3-823d-c7bf32829071",
   "metadata": {},
   "source": [
    "## Delete data from Graph"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "id": "f932e363-dca2-418e-a3ca-936006623f13",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'person.name': 'Don Rickles', 'movie.title': 'Toy Story'}]"
      ]
     },
     "execution_count": 24,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher = \"\"\"\n",
    "    MATCH (person:Person {name:\"Don Rickles\"})-[actedIn:ACTED_IN]->(movie:Movie)\n",
    "    RETURN person.name, movie.title\n",
    "\"\"\"\n",
    "\n",
    "result = knowledge_graph.query(cypher)\n",
    "result"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "id": "1db4a5ad-f1c9-4832-a1dd-46b4c5fd4fdb",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 25,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher = \"\"\"\n",
    "    MATCH (person:Person {name:\"Don Rickles\"})-[actedIn:ACTED_IN]->(movie:Movie)\n",
    "    DELETE actedIn\n",
    "\"\"\"\n",
    "\n",
    "result = knowledge_graph.query(cypher)\n",
    "result"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "id": "eaf63a86-2466-4d90-b935-e1f5734a765c",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 26,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher = \"\"\"\n",
    "    MATCH (person:Person {name:\"Don Rickles\"})-[actedIn:ACTED_IN]->(movie:Movie)\n",
    "    RETURN person.name, movie.title\n",
    "\"\"\"\n",
    "\n",
    "result = knowledge_graph.query(cypher)\n",
    "result"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "1398d807-bcbc-461d-9f28-bfda54880375",
   "metadata": {},
   "source": [
    "## Adding Data to Graph"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "id": "6c859ef7-122d-4766-aad0-ee51b6949274",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'person': {'name': 'Wallace Shawn'}}]"
      ]
     },
     "execution_count": 27,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher = \"\"\"\n",
    "    CREATE (person:Person {name:\"Wallace Shawn\"})\n",
    "    RETURN person\n",
    "\"\"\"\n",
    "\n",
    "result = knowledge_graph.query(cypher)\n",
    "result"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "id": "9513d43a-4210-4948-ba87-70dc9d3d56d1",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'person': {'name': 'Wallace Shawn'},\n",
       "  'hasRelationship': ({'name': 'Wallace Shawn'},\n",
       "   'WORKS_WITH',\n",
       "   {'name': 'Tim Allen'}),\n",
       "  'another_person': {'name': 'Tim Allen'}}]"
      ]
     },
     "execution_count": 28,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher = \"\"\"\n",
    "    MATCH (person:Person {name:\"Wallace Shawn\"}), (another_person:Person {name:\"Tim Allen\"})\n",
    "    MERGE (person)-[hasRelationship:WORKS_WITH]->(another_person)\n",
    "    RETURN person, hasRelationship, another_person\n",
    "\"\"\"\n",
    "\n",
    "result = knowledge_graph.query(cypher)\n",
    "result"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "09923dc3-fea9-42d0-90e9-94e873a8645e",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.19"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
