{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "a328ad15-a403-453c-aa18-9d2759fa3c29",
   "metadata": {},
   "source": [
    "## Setup and Import Libraries"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "5a8954c3-97d1-4d8e-a736-05fb2f52060d",
   "metadata": {},
   "outputs": [],
   "source": [
    "import os\n",
    "import json\n",
    "import textwrap\n",
    "from langchain_community.graphs import Neo4jGraph\n",
    "from langchain_community.vectorstores import Neo4jVector\n",
    "from langchain_openai import ChatOpenAI, OpenAIEmbeddings\n",
    "from langchain.text_splitter import RecursiveCharacterTextSplitter\n",
    "from langchain.chains import RetrievalQAWithSourcesChain\n",
    "from dotenv import load_dotenv\n",
    "\n",
    "import warnings\n",
    "warnings.filterwarnings(\"ignore\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "ff419aab-ba9e-42d9-8d3d-0842a2171a2c",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "True"
      ]
     },
     "execution_count": 2,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "load_dotenv()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "7b9bd171-06e9-41ce-a11c-abb6270e7676",
   "metadata": {},
   "outputs": [],
   "source": [
    "NEO4J_URI = os.getenv('NEO4J_URI')\n",
    "NEO4J_USERNAME = os.getenv('NEO4J_USERNAME')\n",
    "NEO4J_PASSWORD = os.getenv('NEO4J_PASSWORD')\n",
    "NEO4J_DATABASE = os.getenv('NEO4J_DATABASE')\n",
    "OPENAI_API_KEY = os.getenv('OPENAI_API_KEY')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "290fffa7-ae26-489f-81ca-dd1b0f481380",
   "metadata": {},
   "outputs": [],
   "source": [
    "VECTOR_INDEX_NAME = 'form_10k_chunks'\n",
    "VECTOR_NODE_LABEL = 'Chunk'\n",
    "VECTOR_SOURCE_PROPERTY = 'text'\n",
    "VECTOR_EMBEDDING_PROPERTY = 'textEmbedding'"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "1def6694-c909-4a45-99d6-d7c75b205323",
   "metadata": {},
   "outputs": [],
   "source": [
    "knowledge_graph = Neo4jGraph(\n",
    "    url=NEO4J_URI, username=NEO4J_USERNAME,\n",
    "    password=NEO4J_PASSWORD, database=NEO4J_DATABASE\n",
    ")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "b11bbb03-019c-4be3-829c-3233a16b32eb",
   "metadata": {},
   "source": [
    "## Create a Form 10-K Node"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "30e57d2c-a5a9-4828-b62a-10d83e876fc3",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'formInfo': {'cik': '1002047',\n",
       "   'cusip6': '64110D',\n",
       "   'formId': '0000950170-23-027948',\n",
       "   'names': ['Netapp Inc', 'NETAPP INC'],\n",
       "   'source': 'https://www.sec.gov/Archives/edgar/data/1002047/000095017023027948/0000950170-23-027948-index.htm'}}]"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher = \"\"\"\n",
    "    MATCH (anyChunk:Chunk) \n",
    "    WITH anyChunk LIMIT 1\n",
    "    RETURN anyChunk { .names, .source, .formId, .cik, .cusip6 } as formInfo\n",
    "\"\"\"\n",
    "form_info_list = knowledge_graph.query(cypher)\n",
    "form_info_list"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "dc234910-dc57-41ec-9574-620922d8674e",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'cik': '1002047',\n",
       " 'cusip6': '64110D',\n",
       " 'formId': '0000950170-23-027948',\n",
       " 'names': ['Netapp Inc', 'NETAPP INC'],\n",
       " 'source': 'https://www.sec.gov/Archives/edgar/data/1002047/000095017023027948/0000950170-23-027948-index.htm'}"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "form_info = form_info_list[0]['formInfo']\n",
    "form_info"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "cc9e40b7-766b-4483-9111-c355ecfe43da",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher = \"\"\"\n",
    "    MERGE (f:Form {formId: $formInfoParam.formId })\n",
    "      ON CREATE \n",
    "        SET f.names = $formInfoParam.names\n",
    "        SET f.source = $formInfoParam.source\n",
    "        SET f.cik = $formInfoParam.cik\n",
    "        SET f.cusip6 = $formInfoParam.cusip6\n",
    "\"\"\"\n",
    "\n",
    "knowledge_graph.query(cypher, params={'formInfoParam': form_info})"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "20b82f5f-545f-41d2-815a-fbf839e72f95",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'formCount': 1}]"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "knowledge_graph.query(\"MATCH (f:Form) RETURN count(f) as formCount\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "da1f1005-a1ee-4972-ad97-e6c800a605be",
   "metadata": {},
   "source": [
    "## Create a Linked List of Chunks Nodes for Each Section"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "8b2d2610-5f0d-42a4-b35c-4332b000d1d7",
   "metadata": {},
   "source": [
    "### Start by identifying chunks from the same section"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "id": "c376bfba-8f8c-4f86-9582-04e1ee3001ff",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'chunkInfo': {'chunkId': '0000950170-23-027948-item1-chunk0000',\n",
       "   'chunkSeqId': 0,\n",
       "   'f10kItem': 'item1',\n",
       "   'formId': '0000950170-23-027948'}},\n",
       " {'chunkInfo': {'chunkId': '0000950170-23-027948-item1-chunk0001',\n",
       "   'chunkSeqId': 1,\n",
       "   'f10kItem': 'item1',\n",
       "   'formId': '0000950170-23-027948'}},\n",
       " {'chunkInfo': {'chunkId': '0000950170-23-027948-item1-chunk0002',\n",
       "   'chunkSeqId': 2,\n",
       "   'f10kItem': 'item1',\n",
       "   'formId': '0000950170-23-027948'}},\n",
       " {'chunkInfo': {'chunkId': '0000950170-23-027948-item1-chunk0003',\n",
       "   'chunkSeqId': 3,\n",
       "   'f10kItem': 'item1',\n",
       "   'formId': '0000950170-23-027948'}},\n",
       " {'chunkInfo': {'chunkId': '0000950170-23-027948-item1-chunk0004',\n",
       "   'chunkSeqId': 4,\n",
       "   'f10kItem': 'item1',\n",
       "   'formId': '0000950170-23-027948'}},\n",
       " {'chunkInfo': {'chunkId': '0000950170-23-027948-item1-chunk0005',\n",
       "   'chunkSeqId': 5,\n",
       "   'f10kItem': 'item1',\n",
       "   'formId': '0000950170-23-027948'}},\n",
       " {'chunkInfo': {'chunkId': '0000950170-23-027948-item1-chunk0006',\n",
       "   'chunkSeqId': 6,\n",
       "   'f10kItem': 'item1',\n",
       "   'formId': '0000950170-23-027948'}},\n",
       " {'chunkInfo': {'chunkId': '0000950170-23-027948-item1-chunk0007',\n",
       "   'chunkSeqId': 7,\n",
       "   'f10kItem': 'item1',\n",
       "   'formId': '0000950170-23-027948'}},\n",
       " {'chunkInfo': {'chunkId': '0000950170-23-027948-item1-chunk0008',\n",
       "   'chunkSeqId': 8,\n",
       "   'f10kItem': 'item1',\n",
       "   'formId': '0000950170-23-027948'}},\n",
       " {'chunkInfo': {'chunkId': '0000950170-23-027948-item1-chunk0009',\n",
       "   'chunkSeqId': 9,\n",
       "   'f10kItem': 'item1',\n",
       "   'formId': '0000950170-23-027948'}}]"
      ]
     },
     "execution_count": 13,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher = \"\"\"\n",
    "    MATCH (from_same_form:Chunk)\n",
    "    WHERE from_same_form.formId = $formIdParam\n",
    "    RETURN from_same_form {.formId, .f10kItem, .chunkId, .chunkSeqId } as chunkInfo\n",
    "    LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "knowledge_graph.query(cypher, params={'formIdParam': form_info['formId']})"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "b2d6073b-d416-4714-a66a-740b78c816c4",
   "metadata": {},
   "source": [
    "### Order chunks by their sequence ID"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "id": "68779973-67e8-44d6-8b44-4462f09ab80e",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'chunkInfo': {'formId': '0000950170-23-027948',\n",
       "   'f10kItem': 'item7a',\n",
       "   'chunkId': '0000950170-23-027948-item7a-chunk0000',\n",
       "   'chunkSeqId': 0}},\n",
       " {'chunkInfo': {'formId': '0000950170-23-027948',\n",
       "   'f10kItem': 'item7',\n",
       "   'chunkId': '0000950170-23-027948-item7-chunk0000',\n",
       "   'chunkSeqId': 0}},\n",
       " {'chunkInfo': {'formId': '0000950170-23-027948',\n",
       "   'f10kItem': 'item1a',\n",
       "   'chunkId': '0000950170-23-027948-item1a-chunk0000',\n",
       "   'chunkSeqId': 0}},\n",
       " {'chunkInfo': {'formId': '0000950170-23-027948',\n",
       "   'f10kItem': 'item1',\n",
       "   'chunkId': '0000950170-23-027948-item1-chunk0000',\n",
       "   'chunkSeqId': 0}},\n",
       " {'chunkInfo': {'formId': '0000950170-23-027948',\n",
       "   'f10kItem': 'item1',\n",
       "   'chunkId': '0000950170-23-027948-item1-chunk0001',\n",
       "   'chunkSeqId': 1}},\n",
       " {'chunkInfo': {'formId': '0000950170-23-027948',\n",
       "   'f10kItem': 'item1',\n",
       "   'chunkId': '0000950170-23-027948-item1-chunk0002',\n",
       "   'chunkSeqId': 2}},\n",
       " {'chunkInfo': {'formId': '0000950170-23-027948',\n",
       "   'f10kItem': 'item1',\n",
       "   'chunkId': '0000950170-23-027948-item1-chunk0003',\n",
       "   'chunkSeqId': 3}},\n",
       " {'chunkInfo': {'formId': '0000950170-23-027948',\n",
       "   'f10kItem': 'item1',\n",
       "   'chunkId': '0000950170-23-027948-item1-chunk0004',\n",
       "   'chunkSeqId': 4}},\n",
       " {'chunkInfo': {'formId': '0000950170-23-027948',\n",
       "   'f10kItem': 'item1',\n",
       "   'chunkId': '0000950170-23-027948-item1-chunk0005',\n",
       "   'chunkSeqId': 5}},\n",
       " {'chunkInfo': {'formId': '0000950170-23-027948',\n",
       "   'f10kItem': 'item1',\n",
       "   'chunkId': '0000950170-23-027948-item1-chunk0006',\n",
       "   'chunkSeqId': 6}}]"
      ]
     },
     "execution_count": 14,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher = \"\"\"\n",
    "    MATCH (from_same_form:Chunk)\n",
    "    WHERE from_same_form.formId = $formIdParam\n",
    "    RETURN from_same_form {.formId, .f10kItem, .chunkId, .chunkSeqId } as chunkInfo \n",
    "    ORDER BY from_same_form.chunkSeqId ASC\n",
    "    LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "knowledge_graph.query(cypher, params={'formIdParam': form_info['formId']})"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "123d83a7-64c5-41cf-9a30-a086a40ef4f3",
   "metadata": {},
   "source": [
    "### Limit chunks to just the \"Item 1\" section, the organize in ascending order"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "id": "56437358-4d2b-457d-b43d-5eee2031bd29",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'from_same_section': {'chunkId': '0000950170-23-027948-item1-chunk0000',\n",
       "   'chunkSeqId': 0,\n",
       "   'f10kItem': 'item1',\n",
       "   'formId': '0000950170-23-027948'}},\n",
       " {'from_same_section': {'chunkId': '0000950170-23-027948-item1-chunk0001',\n",
       "   'chunkSeqId': 1,\n",
       "   'f10kItem': 'item1',\n",
       "   'formId': '0000950170-23-027948'}},\n",
       " {'from_same_section': {'chunkId': '0000950170-23-027948-item1-chunk0002',\n",
       "   'chunkSeqId': 2,\n",
       "   'f10kItem': 'item1',\n",
       "   'formId': '0000950170-23-027948'}},\n",
       " {'from_same_section': {'chunkId': '0000950170-23-027948-item1-chunk0003',\n",
       "   'chunkSeqId': 3,\n",
       "   'f10kItem': 'item1',\n",
       "   'formId': '0000950170-23-027948'}},\n",
       " {'from_same_section': {'chunkId': '0000950170-23-027948-item1-chunk0004',\n",
       "   'chunkSeqId': 4,\n",
       "   'f10kItem': 'item1',\n",
       "   'formId': '0000950170-23-027948'}},\n",
       " {'from_same_section': {'chunkId': '0000950170-23-027948-item1-chunk0005',\n",
       "   'chunkSeqId': 5,\n",
       "   'f10kItem': 'item1',\n",
       "   'formId': '0000950170-23-027948'}},\n",
       " {'from_same_section': {'chunkId': '0000950170-23-027948-item1-chunk0006',\n",
       "   'chunkSeqId': 6,\n",
       "   'f10kItem': 'item1',\n",
       "   'formId': '0000950170-23-027948'}},\n",
       " {'from_same_section': {'chunkId': '0000950170-23-027948-item1-chunk0007',\n",
       "   'chunkSeqId': 7,\n",
       "   'f10kItem': 'item1',\n",
       "   'formId': '0000950170-23-027948'}},\n",
       " {'from_same_section': {'chunkId': '0000950170-23-027948-item1-chunk0008',\n",
       "   'chunkSeqId': 8,\n",
       "   'f10kItem': 'item1',\n",
       "   'formId': '0000950170-23-027948'}},\n",
       " {'from_same_section': {'chunkId': '0000950170-23-027948-item1-chunk0009',\n",
       "   'chunkSeqId': 9,\n",
       "   'f10kItem': 'item1',\n",
       "   'formId': '0000950170-23-027948'}}]"
      ]
     },
     "execution_count": 15,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher = \"\"\"\n",
    "    MATCH (from_same_section:Chunk)\n",
    "    WHERE from_same_section.formId = $formIdParam\n",
    "    AND from_same_section.f10kItem = $f10kItemParam // NEW!!!\n",
    "    RETURN from_same_section { .formId, .f10kItem, .chunkId, .chunkSeqId } \n",
    "    ORDER BY from_same_section.chunkSeqId ASC\n",
    "    LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "knowledge_graph.query(\n",
    "    cypher, params={\n",
    "        'formIdParam': form_info['formId'], \n",
    "        'f10kItemParam': 'item1'\n",
    "    }\n",
    ")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "4199b246-5341-403b-9596-943a403ddb2d",
   "metadata": {},
   "source": [
    "### Collect ordered chunks into a list"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "id": "a80f10f5-aba1-45e9-865a-4d2a9b1bce6d",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'collect(from_same_section)': [{'chunkId': '0000950170-23-027948-item1-chunk0000',\n",
       "    'chunkSeqId': 0,\n",
       "    'f10kItem': 'item1',\n",
       "    'formId': '0000950170-23-027948'},\n",
       "   {'chunkId': '0000950170-23-027948-item1-chunk0001',\n",
       "    'chunkSeqId': 1,\n",
       "    'f10kItem': 'item1',\n",
       "    'formId': '0000950170-23-027948'},\n",
       "   {'chunkId': '0000950170-23-027948-item1-chunk0002',\n",
       "    'chunkSeqId': 2,\n",
       "    'f10kItem': 'item1',\n",
       "    'formId': '0000950170-23-027948'},\n",
       "   {'chunkId': '0000950170-23-027948-item1-chunk0003',\n",
       "    'chunkSeqId': 3,\n",
       "    'f10kItem': 'item1',\n",
       "    'formId': '0000950170-23-027948'},\n",
       "   {'chunkId': '0000950170-23-027948-item1-chunk0004',\n",
       "    'chunkSeqId': 4,\n",
       "    'f10kItem': 'item1',\n",
       "    'formId': '0000950170-23-027948'},\n",
       "   {'chunkId': '0000950170-23-027948-item1-chunk0005',\n",
       "    'chunkSeqId': 5,\n",
       "    'f10kItem': 'item1',\n",
       "    'formId': '0000950170-23-027948'},\n",
       "   {'chunkId': '0000950170-23-027948-item1-chunk0006',\n",
       "    'chunkSeqId': 6,\n",
       "    'f10kItem': 'item1',\n",
       "    'formId': '0000950170-23-027948'},\n",
       "   {'chunkId': '0000950170-23-027948-item1-chunk0007',\n",
       "    'chunkSeqId': 7,\n",
       "    'f10kItem': 'item1',\n",
       "    'formId': '0000950170-23-027948'},\n",
       "   {'chunkId': '0000950170-23-027948-item1-chunk0008',\n",
       "    'chunkSeqId': 8,\n",
       "    'f10kItem': 'item1',\n",
       "    'formId': '0000950170-23-027948'},\n",
       "   {'chunkId': '0000950170-23-027948-item1-chunk0009',\n",
       "    'chunkSeqId': 9,\n",
       "    'f10kItem': 'item1',\n",
       "    'formId': '0000950170-23-027948'}]}]"
      ]
     },
     "execution_count": 16,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher = \"\"\"\n",
    "    MATCH (from_same_section:Chunk)\n",
    "    WHERE from_same_section.formId = $formIdParam\n",
    "    AND from_same_section.f10kItem = $f10kItemParam\n",
    "    WITH from_same_section { .formId, .f10kItem, .chunkId, .chunkSeqId } \n",
    "    ORDER BY from_same_section.chunkSeqId ASC\n",
    "    LIMIT 10\n",
    "    RETURN collect(from_same_section) // NEW!!!\n",
    "\"\"\"\n",
    "\n",
    "knowledge_graph.query(\n",
    "    cypher, params={\n",
    "        'formIdParam': form_info['formId'], \n",
    "        'f10kItemParam': 'item1'\n",
    "    }\n",
    ")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "170723dd-91b1-487b-abcb-320964d5e1bf",
   "metadata": {},
   "source": [
    "## Add a NEXT Relationship Between Subsequent Chunks"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "id": "71e07f40-6df8-40fe-b005-3dc993b7b0cd",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'size(section_chunk_list)': 20}]"
      ]
     },
     "execution_count": 17,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher = \"\"\"\n",
    "    MATCH (from_same_section:Chunk)\n",
    "    WHERE from_same_section.formId = $formIdParam\n",
    "    AND from_same_section.f10kItem = $f10kItemParam\n",
    "    WITH from_same_section\n",
    "    ORDER BY from_same_section.chunkSeqId ASC\n",
    "    WITH collect(from_same_section) as section_chunk_list\n",
    "    CALL apoc.nodes.link(\n",
    "        section_chunk_list, \n",
    "        \"NEXT\", \n",
    "        {avoidDuplicates: true}\n",
    "    )  // NEW!!!\n",
    "  RETURN size(section_chunk_list)\n",
    "\"\"\"\n",
    "\n",
    "knowledge_graph.query(\n",
    "    cypher, params={\n",
    "        'formIdParam': form_info['formId'], \n",
    "        'f10kItemParam': 'item1'\n",
    "    }\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "id": "2fdba137-5d6c-4212-b175-76f712c7eaa2",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Node properties:\n",
      "Chunk {chunkId: STRING, names: LIST, formId: STRING, cik: STRING, cusip6: STRING, source: STRING, f10kItem: STRING, chunkSeqId: INTEGER, text: STRING, textEmbedding: LIST}\n",
      "Form {names: LIST, formId: STRING, cik: STRING, cusip6: STRING, source: STRING}\n",
      "Relationship properties:\n",
      "\n",
      "The relationships:\n",
      "(:Chunk)-[:NEXT]->(:Chunk)\n"
     ]
    }
   ],
   "source": [
    "knowledge_graph.refresh_schema()\n",
    "print(knowledge_graph.schema)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "e404d780-96be-428f-9437-e5eafba4f973",
   "metadata": {},
   "source": [
    "### Loop through and create relationships for all sections of the form 10-K"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "id": "8f8a06c3-f9b4-441d-9aab-158ecab14d79",
   "metadata": {},
   "outputs": [],
   "source": [
    "cypher = \"\"\"\n",
    "    MATCH (from_same_section:Chunk)\n",
    "    WHERE from_same_section.formId = $formIdParam\n",
    "    AND from_same_section.f10kItem = $f10kItemParam\n",
    "    WITH from_same_section\n",
    "    ORDER BY from_same_section.chunkSeqId ASC\n",
    "    WITH collect(from_same_section) as section_chunk_list\n",
    "    CALL apoc.nodes.link(\n",
    "        section_chunk_list, \n",
    "        \"NEXT\", \n",
    "        {avoidDuplicates: true}\n",
    "    )\n",
    "  RETURN size(section_chunk_list)\n",
    "\"\"\"\n",
    "\n",
    "for form10kItemName in ['item1', 'item1a', 'item7', 'item7a']:\n",
    "    knowledge_graph.query(\n",
    "        cypher, params={\n",
    "            'formIdParam':form_info['formId'],\n",
    "            'f10kItemParam': form10kItemName\n",
    "        }\n",
    "    )"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "530fe732-de81-4d5e-a993-ada1daa3960c",
   "metadata": {},
   "source": [
    "## Connect chunks to their parent form with a PART_OF relationship"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "id": "56ad225f-c998-4cc0-bc66-85ed074e8771",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'count(newRelationship)': 23}]"
      ]
     },
     "execution_count": 22,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher = \"\"\"\n",
    "    MATCH (c:Chunk), (f:Form)\n",
    "    WHERE c.formId = f.formId\n",
    "    MERGE (c)-[newRelationship:PART_OF]->(f)\n",
    "    RETURN count(newRelationship)\n",
    "\"\"\"\n",
    "\n",
    "knowledge_graph.query(cypher)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "b7243e88-de7f-44f0-87f3-ea7d8884ad9b",
   "metadata": {},
   "source": [
    "## Create a SECTION relationship on first chunk of each section"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "id": "9ef183ac-299e-4654-b657-b903872f8506",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'count(r)': 4}]"
      ]
     },
     "execution_count": 23,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher = \"\"\"\n",
    "    MATCH (first:Chunk), (f:Form)\n",
    "    WHERE first.formId = f.formId\n",
    "    AND first.chunkSeqId = 0\n",
    "    WITH first, f\n",
    "    MERGE (f)-[r:SECTION {f10kItem: first.f10kItem}]->(first)\n",
    "    RETURN count(r)\n",
    "\"\"\"\n",
    "\n",
    "knowledge_graph.query(cypher)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "1232f8cc-66a3-49e9-9619-957bd873fdb9",
   "metadata": {},
   "source": [
    "## Example Cypher Queries"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "a870c1e7-9af1-4efd-ba42-1774993251ba",
   "metadata": {},
   "source": [
    "### Return the first chunk of the Item 1 section"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "id": "80dc20cf-edcd-4dba-b8da-517a5d6e4e43",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'chunkId': '0000950170-23-027948-item1-chunk0000',\n",
       " 'text': '>Item 1.  \\nBusiness\\n\\n\\nOverview\\n\\n\\nNetApp, Inc. (NetApp, we, us or the Company) is a global cloud-led, data-centric software company. We were incorporated in 1992 and are headquartered in San Jose, California. Building on more than three decades of innovation, we give customers the freedom to manage applications and data across hybrid multicloud environments. Our portfolio of cloud services, and storage infrastructure, powered by intelligent data management software, enables applications to run faster, more reliably, and more securely, all at a lower cost.\\n\\n\\nOur opportunity is defined by the durable megatrends of data-driven digital and cloud transformations. NetApp helps organizations meet the complexities created by rapid data and cloud growth, multi-cloud management, and the adoption of next-generation technologies, such as AI, Kubernetes, and modern databases. Our modern approach to hybrid, multicloud infrastructure and data management, which we term ‘evolved cloud’, provides customers the ability to leverage data across their entire estate with simplicity, security, and sustainability which increases our relevance and value to our customers.\\n\\n\\nIn an evolved cloud state, the cloud is fully integrated into an organization’s architecture and operations. Data centers and clouds are seamlessly united and hybrid multicloud operations are simplified, with consistency and observability across environments. The key benefits NetApp brings to an organization’s hybrid multicloud environment are:\\n\\n\\n•\\nOperational simplicity: NetApp’s use of open source, open architectures and APIs, microservices, and common capabilities and data services facilitate the creation of applications that can run anywhere.\\n\\n\\n•\\nFlexibility and consistency: NetApp makes moving data and applications between environments seamless through a common storage foundation across on-premises and multicloud environments.'}"
      ]
     },
     "execution_count": 24,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher = \"\"\"\n",
    "    MATCH (f:Form)-[r:SECTION]->(first:Chunk)\n",
    "    WHERE f.formId = $formIdParam\n",
    "    AND r.f10kItem = $f10kItemParam\n",
    "    RETURN first.chunkId as chunkId, first.text as text\n",
    "\"\"\"\n",
    "\n",
    "first_chunk_info = knowledge_graph.query(cypher, params={\n",
    "    'formIdParam': form_info['formId'], \n",
    "    'f10kItemParam': 'item1'\n",
    "})[0]\n",
    "\n",
    "first_chunk_info"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "c88ecab3-f428-454d-996d-1e2c13a4d587",
   "metadata": {},
   "source": [
    "### Get the second chunk of the Item 1 section"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "id": "e2da7dfd-ec84-47b1-8f31-40bb5a625728",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'chunkId': '0000950170-23-027948-item1-chunk0001',\n",
       " 'text': \"•\\nFlexibility and consistency: NetApp makes moving data and applications between environments seamless through a common storage foundation across on-premises and multicloud environments.\\n\\n\\n•\\nCyber resilience: NetApp unifies monitoring, data protection, security, governance, and compliance for total cyber resilience - with consistency and automation across environments. \\n\\n\\n•\\nContinuous operations: NetApp uses AI-driven automation for continuous optimization to service applications and store stateless and stateful applications at the lowest possible costs.\\n\\n\\n•\\nSustainability: NetApp has industry-leading tools to audit consumption, locate waste, and set guardrails to stop overprovisioning.\\n\\n\\nProduct, Solutions and Services Portfolio\\n \\n\\n\\nNetApp's portfolio of cloud services and storage infrastructure is powered by intelligent data management software. Our operations are organized into two segments: Hybrid Cloud and Public Cloud.\\n\\n\\n \\n\\n\\nHybrid Cloud\\n\\n\\nHybrid Cloud \\noffers a portfolio of storage management and infrastructure solutions that help customers recast their traditional data centers into modern data centers with the power of the cloud. Our hybrid cloud portfolio is designed to operate with public clouds to unlock the potential of hybrid, multi-cloud operations. We offer a broad portfolio of cloud-connected all-flash, hybrid-flash, and object storage systems, powered by intelligent data management software. Hybrid Cloud is composed of software, hardware, and related support, as well as professional and other services.\\n\\n\\nIntelligent data management software\"}"
      ]
     },
     "execution_count": 25,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher = \"\"\"\n",
    "    MATCH (first:Chunk)-[:NEXT]->(nextChunk:Chunk)\n",
    "    WHERE first.chunkId = $chunkIdParam\n",
    "    RETURN nextChunk.chunkId as chunkId, nextChunk.text as text\n",
    "\"\"\"\n",
    "\n",
    "next_chunk_info = knowledge_graph.query(cypher, params={\n",
    "    'chunkIdParam': first_chunk_info['chunkId']\n",
    "})[0]\n",
    "\n",
    "next_chunk_info"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "78369a0b-e211-4831-9dff-2d82def6ab30",
   "metadata": {},
   "source": [
    "### Return a window of three chunks"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "id": "b8c260ea-b458-4d81-a26e-eb8b44d6c9d6",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'c1.chunkId': '0000950170-23-027948-item1-chunk0000',\n",
       "  'c2.chunkId': '0000950170-23-027948-item1-chunk0001',\n",
       "  'c3.chunkId': '0000950170-23-027948-item1-chunk0002'}]"
      ]
     },
     "execution_count": 26,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher = \"\"\"\n",
    "    MATCH (c1:Chunk)-[:NEXT]->(c2:Chunk)-[:NEXT]->(c3:Chunk) \n",
    "    WHERE c2.chunkId = $chunkIdParam\n",
    "    RETURN c1.chunkId, c2.chunkId, c3.chunkId\n",
    "\"\"\"\n",
    "\n",
    "knowledge_graph.query(\n",
    "    cypher, params={\n",
    "        'chunkIdParam': next_chunk_info['chunkId']\n",
    "    }\n",
    ")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "61fa1e25-89d4-411b-8d5d-76daf6b2858a",
   "metadata": {},
   "source": [
    "## Information is stored in the structure of a graph\n",
    "\n",
    "- Matched patterns of nodes and relationships in a graph are called paths\n",
    "- The length of a path is equal to the number of relationships in the path\n",
    "- Paths can be captured as variables and used elsewhere in queries"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "id": "25b24568-1d6c-4427-8abc-51f7ca153c26",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'windowPathLength': 2}]"
      ]
     },
     "execution_count": 27,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher = \"\"\"\n",
    "    MATCH window = (c1:Chunk)-[:NEXT]->(c2:Chunk)-[:NEXT]->(c3:Chunk) \n",
    "    WHERE c1.chunkId = $chunkIdParam\n",
    "    RETURN length(window) as windowPathLength\n",
    "\"\"\"\n",
    "\n",
    "knowledge_graph.query(\n",
    "    cypher, params={'chunkIdParam': next_chunk_info['chunkId']}\n",
    ")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "c57de452-14ad-4ceb-aca6-d268f4ae1828",
   "metadata": {},
   "source": [
    "## Finding variable length windows\n",
    "\n",
    "- A pattern match will fail if the relationship doesn't exist in the graph\n",
    "- For example, the first chunk in a section has no preceding chunk, so the next query won't return anything"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "id": "2510700a-87ee-4f2e-965f-c68c035b0b63",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 29,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher = \"\"\"\n",
    "    MATCH window=(c1:Chunk)-[:NEXT]->(c2:Chunk)-[:NEXT]->(c3:Chunk) \n",
    "    WHERE c2.chunkId = $chunkIdParam\n",
    "    RETURN nodes(window) as chunkList\n",
    "\"\"\"\n",
    "\n",
    "# pull the chunk ID from the first \n",
    "knowledge_graph.query(\n",
    "    cypher, params={\n",
    "        'chunkIdParam': first_chunk_info['chunkId']\n",
    "    }\n",
    ")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "dd1fe4c1-4b32-4e4b-a74c-aa67cdbc0395",
   "metadata": {},
   "source": [
    "### Modify NEXT relationship to have variable length"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "id": "de8a239c-42b3-42e4-978d-ae4579674597",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'length(window)': 0}, {'length(window)': 1}]"
      ]
     },
     "execution_count": 30,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher = \"\"\"\n",
    "    MATCH window=\n",
    "        (:Chunk)-[:NEXT*0..1]->(c:Chunk)-[:NEXT*0..1]->(:Chunk) \n",
    "    WHERE c.chunkId = $chunkIdParam\n",
    "    RETURN length(window)\n",
    "  \"\"\"\n",
    "\n",
    "knowledge_graph.query(\n",
    "    cypher, params={\n",
    "        'chunkIdParam': first_chunk_info['chunkId']\n",
    "    }\n",
    ")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "ef15ff93-4f6a-4679-a6d0-7d3c7317d098",
   "metadata": {},
   "source": [
    "### Retrieve only the longest path"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "id": "81a3108f-e9f9-47d8-a8bf-3d644fca4e89",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'length(longestChunkWindow)': 1}]"
      ]
     },
     "execution_count": 32,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher = \"\"\"\n",
    "    MATCH window=\n",
    "        (:Chunk)-[:NEXT*0..1]->(c:Chunk)-[:NEXT*0..1]->(:Chunk)\n",
    "    WHERE c.chunkId = $chunkIdParam\n",
    "    WITH window as longestChunkWindow \n",
    "    ORDER BY length(window) DESC LIMIT 1\n",
    "    RETURN length(longestChunkWindow)\n",
    "\"\"\"\n",
    "\n",
    "knowledge_graph.query(\n",
    "    cypher, params={\n",
    "        'chunkIdParam': first_chunk_info['chunkId']\n",
    "    }\n",
    ")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "dbecc708-0181-43ef-8194-db4a1fc65968",
   "metadata": {},
   "source": [
    "## Customize the results of the similarity search using Cypher\n",
    "\n",
    "- Extend the vector store definition to accept a Cypher query\n",
    "- The Cypher query takes the results of the vector similarity search and then modifies them in some way\n",
    "- Start with a simple query that just returns some extra text along with the search results"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "id": "b4a5e671-7e0a-4fe9-8382-5c88a4181063",
   "metadata": {},
   "outputs": [],
   "source": [
    "retrieval_query_extra_text = \"\"\"\n",
    "    WITH node, score, \"Andreas knows Cypher. \" as extraText\n",
    "    RETURN extraText + \"\\n\" + node.text as text,\n",
    "    score,\n",
    "    node {.source} AS metadata\n",
    "\"\"\""
   ]
  },
  {
   "cell_type": "markdown",
   "id": "14e6bc6a-e184-4330-a0ab-f31c81245cf4",
   "metadata": {},
   "source": [
    "### Set up the vector store to use the query, then instantiate a retriever and Question-Answer chain in LangChain"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 36,
   "id": "b81650de-cf35-4811-8d66-7b2cb2c4af9a",
   "metadata": {},
   "outputs": [],
   "source": [
    "vector_store_extra_text = Neo4jVector.from_existing_index(\n",
    "    embedding=OpenAIEmbeddings(),\n",
    "    url=NEO4J_URI,\n",
    "    username=NEO4J_USERNAME,\n",
    "    password=NEO4J_PASSWORD,\n",
    "    database=NEO4J_DATABASE,\n",
    "    index_name=VECTOR_INDEX_NAME,\n",
    "    text_node_property=VECTOR_SOURCE_PROPERTY,\n",
    "    retrieval_query=retrieval_query_extra_text, # NEW !!!\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 37,
   "id": "57640975-810d-4bc7-b6b1-b902da3aae08",
   "metadata": {},
   "outputs": [],
   "source": [
    "retriever_extra_text = vector_store_extra_text.as_retriever()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 38,
   "id": "964b6447-7ce5-479b-9319-a262f76d28bd",
   "metadata": {},
   "outputs": [],
   "source": [
    "chain_extra_text = RetrievalQAWithSourcesChain.from_chain_type(\n",
    "    ChatOpenAI(temperature=0), \n",
    "    chain_type=\"stuff\", \n",
    "    retriever=retriever_extra_text\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 40,
   "id": "064dcd4e-98fd-48bb-8854-746bc07b4134",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'answer': 'Andreas knows about Cypher, Human Capital, Diversity, Inclusion, and Belonging, Benefits, Wellbeing, and Engagement, Manufacturing, and Supply Chain.\\n',\n",
       " 'sources': 'https://www.sec.gov/Archives/edgar/data/1002047/000095017023027948/0000950170-23-027948-index.htm'}"
      ]
     },
     "execution_count": 40,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "chain_extra_text.invoke(\n",
    "    {\"question\": \"What topics does Andreas know about?\"},\n",
    "    return_only_outputs=True\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 41,
   "id": "e70710ee-96ab-4cc5-bb7a-cefae85b02f6",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'answer': 'Andreas knows about Cypher.\\n',\n",
       " 'sources': 'https://www.sec.gov/Archives/edgar/data/1002047/000095017023027948/0000950170-23-027948-index.htm'}"
      ]
     },
     "execution_count": 41,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "chain_extra_text.invoke(\n",
    "    {\"question\": \"What single topic does Andreas know about?\"},\n",
    "    return_only_outputs=True\n",
    ")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "c8eb9824-2a5c-43d4-a5b6-8744887d8630",
   "metadata": {},
   "source": [
    "## Expand context around a chunk using a window\n",
    "\n",
    "### First, create a regular vector store that retrieves a single node"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 42,
   "id": "98108455-3f68-446c-b804-4efd8e6c2fd1",
   "metadata": {},
   "outputs": [],
   "source": [
    "neo4j_vector_store = Neo4jVector.from_existing_graph(\n",
    "    embedding=OpenAIEmbeddings(),\n",
    "    url=NEO4J_URI,\n",
    "    username=NEO4J_USERNAME,\n",
    "    password=NEO4J_PASSWORD,\n",
    "    index_name=VECTOR_INDEX_NAME,\n",
    "    node_label=VECTOR_NODE_LABEL,\n",
    "    text_node_properties=[VECTOR_SOURCE_PROPERTY],\n",
    "    embedding_node_property=VECTOR_EMBEDDING_PROPERTY,\n",
    ")\n",
    "\n",
    "windowless_retriever = neo4j_vector_store.as_retriever()\n",
    "\n",
    "windowless_chain = RetrievalQAWithSourcesChain.from_chain_type(\n",
    "    ChatOpenAI(temperature=0), \n",
    "    chain_type=\"stuff\", \n",
    "    retriever=windowless_retriever\n",
    ")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "8a4c3e49-3a05-43d7-91c7-3f7b37ce7e70",
   "metadata": {},
   "source": [
    "### Next, define a window retrieval query to get consecutive chunks"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 43,
   "id": "e6934490-a1ae-4298-98ff-be3b5bb6ea07",
   "metadata": {},
   "outputs": [],
   "source": [
    "retrieval_query_window = \"\"\"\n",
    "MATCH window=\n",
    "    (:Chunk)-[:NEXT*0..1]->(node)-[:NEXT*0..1]->(:Chunk)\n",
    "WITH node, score, window as longestWindow \n",
    "  ORDER BY length(window) DESC LIMIT 1\n",
    "WITH nodes(longestWindow) as chunkList, node, score\n",
    "  UNWIND chunkList as chunkRows\n",
    "WITH collect(chunkRows.text) as textList, node, score\n",
    "RETURN apoc.text.join(textList, \" \\n \") as text,\n",
    "    score,\n",
    "    node {.source} AS metadata\n",
    "\"\"\""
   ]
  },
  {
   "cell_type": "markdown",
   "id": "6bfc6460-be4a-42b4-a761-5fe756ab60fc",
   "metadata": {},
   "source": [
    "### Set up a QA chain that will use the window retrieval query"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 45,
   "id": "faefe324-a28c-47a5-a2a0-6d5d7efebfa6",
   "metadata": {},
   "outputs": [],
   "source": [
    "vector_store_window = Neo4jVector.from_existing_index(\n",
    "    embedding=OpenAIEmbeddings(),\n",
    "    url=NEO4J_URI,\n",
    "    username=NEO4J_USERNAME,\n",
    "    password=NEO4J_PASSWORD,\n",
    "    database=NEO4J_DATABASE,\n",
    "    index_name=VECTOR_INDEX_NAME,\n",
    "    text_node_property=VECTOR_SOURCE_PROPERTY,\n",
    "    retrieval_query=retrieval_query_window, # NEW!!!\n",
    ")\n",
    "\n",
    "retriever_window = vector_store_window.as_retriever()\n",
    "\n",
    "chain_window = RetrievalQAWithSourcesChain.from_chain_type(\n",
    "    ChatOpenAI(temperature=0), \n",
    "    chain_type=\"stuff\", \n",
    "    retriever=retriever_window\n",
    ")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "ec1a348b-bf3b-4108-9187-bce520f8484d",
   "metadata": {},
   "source": [
    "### Compare two Chains"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 46,
   "id": "f18b47a5-1141-4bb5-8a1e-a138977a7694",
   "metadata": {},
   "outputs": [],
   "source": [
    "question = \"In a single sentence, tell me about Netapp's business.\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 47,
   "id": "a1b1f43c-216f-404b-91b5-b28525f5491a",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "NetApp is a global cloud-led, data-centric software company that\n",
      "provides customers with the freedom to manage applications and data\n",
      "across hybrid multicloud environments, offering a portfolio of cloud\n",
      "services and storage infrastructure powered by intelligent data\n",
      "management software.\n"
     ]
    }
   ],
   "source": [
    "answer = windowless_chain(\n",
    "    {\"question\": question},\n",
    "    return_only_outputs=True,\n",
    ")\n",
    "\n",
    "print(textwrap.fill(answer[\"answer\"]))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 48,
   "id": "ce8d7d13-b264-4645-8d0b-c3a3c1a8cd8d",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "NetApp is a company that offers storage-as-a-service and global\n",
      "support for hybrid cloud environments, with a focus on enterprise\n",
      "storage, data management, and cloud operations, serving a diverse\n",
      "customer base across various industries through direct sales and\n",
      "partnerships with leading cloud providers.\n"
     ]
    }
   ],
   "source": [
    "answer = chain_window(\n",
    "    {\"question\": question},\n",
    "    return_only_outputs=True,\n",
    ")\n",
    "print(textwrap.fill(answer[\"answer\"]))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "a053a98c-de10-4768-a6a3-ab89c8d8911d",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.19"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
